// - є масив [2,17,13,6,22,31,45,66,100,-18] :
let numbers = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
let i = 0;
while (i<numbers.length) {
    let number = numbers [i];
    console.log(number);
    i++;
}
//     2. перебрати його циклом for
for (let j = 0; j < numbers.length; j++) {
    const number = numbers[j];
    console.log(number)
}
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
let k = 0;
while (k<numbers.length) {
    let number = numbers [k];
    if (k%2 !== 0)
    console.log(number);
    k++;
}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
for (let j = 0; j < numbers.length; j++) {
    const number = numbers[j];
    if (j%2 !== 0)
    console.log(number);
}
// 5. перебрати циклом while та вивести  числа тільки парні  значення
let ii = 0;
while (ii<numbers.length) {
    let number = numbers [ii];
    if (number%2 === 0)
    console.log(number);
    ii++;
}
// 6. перебрати циклом for та вивести  числа тільки парні  значення
for (let j = 0; j < numbers.length; j++) {
    const number = numbers[j];
    if (number%2 === 0)
        console.log(number)
}
// 7. замінити кожне число кратне 3 на слово "okten"
for (let j = 0; j < numbers.length; j++) {
    const number = numbers[j];
    if (number%3 === 0) {
        const number = 'okten'
    }
    console.log(number)
}

// 8. вивести масив в зворотньому порядку.
for (let j = numbers.length - 1; j >= 0; j--) {
    const number = numbers[j];
    console.log(number)
}
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//вивести  числа тільки з непарним індексом
for (let j = numbers.length - 1; j >= 0; j--) {
    const number = numbers[j];
    if (j%2 !== 0 )
    console.log(number)
}
//вивести  числа тільки парні  значення
for (let j = numbers.length - 1; j >= 0; j--) {
    const number = numbers[j];
    if (j%2 === 0)
    console.log(number)
}
//замінити кожне число кратне 3 на слово "okten"
for (let j = numbers.length - 1; j >= 0; j--) {
    let number = numbers[j];
    if (number%3 === 0) {
        console.log('okten')
    }else (!=number)
}

//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор